SET FOREIGN_KEY_CHECKS=0;
SET SQL_MODE = "NO_AUTO_VALUE_ON_ZERO";
SET AUTOCOMMIT = 0;
START TRANSACTION;
SET time_zone = "+00:00";

/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET @OLD_CHARACTER_SET_RESULTS=@@CHARACTER_SET_RESULTS */;
/*!40101 SET @OLD_COLLATION_CONNECTION=@@COLLATION_CONNECTION */;
/*!40101 SET NAMES utf8mb4 */;


DROP TABLE IF EXISTS `drop_data_global`;
CREATE TABLE `drop_data_global` (
  `id` bigint(20) NOT NULL,
  `continent` int(11) NOT NULL DEFAULT -1,
  `drop_type` tinyint(1) NOT NULL DEFAULT 0,
  `item_id` int(11) NOT NULL DEFAULT 0,
  `minimum_quantity` int(10) UNSIGNED NOT NULL DEFAULT 1,
  `maximum_quantity` int(10) UNSIGNED NOT NULL DEFAULT 1,
  `quest_id` int(11) NOT NULL DEFAULT 0,
  `chance` int(10) UNSIGNED NOT NULL DEFAULT 0 COMMENT '百萬分之',
  `comments` varchar(255) COLLATE utf8mb4_unicode_ci DEFAULT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci ROW_FORMAT=DYNAMIC;

INSERT INTO `drop_data_global` (`id`, `continent`, `drop_type`, `item_id`, `minimum_quantity`, `maximum_quantity`, `quest_id`, `chance`, `comments`) VALUES
(1, -1, 0, 0, 1, 1, 0, 20000, '楓葉點數'),
(2, -1, 0, 4001126, 1, 1, 0, 200000, '楓葉'),
(3, -1, 0, 1002758, 1, 1, 0, 1000, '楓葉頭盔'),
(4, -1, 0, 1082252, 1, 1, 0, 1000, '楓葉手套'),
(5, -1, 0, 1092030, 1, 1, 0, 1000, '楓葉之盾'),
(6, -1, 0, 1092045, 1, 1, 0, 1000, '楓葉法盾'),
(7, -1, 0, 1092046, 1, 1, 0, 1000, '楓葉戰盾'),
(8, -1, 0, 1092047, 1, 1, 0, 1000, '楓葉護腕'),
(9, -1, 0, 1102166, 1, 1, 0, 2000, '楓葉披風 - 20 等'),
(10, -1, 0, 1102167, 1, 1, 0, 1000, '楓葉披風 - 40 等'),
(11, -1, 0, 1102168, 1, 1, 0, 500, '楓葉披風 - 70 等'),
(12, -1, 0, 1122015, 1, 1, 0, 1000, '楓葉頭巾'),
(13, -1, 0, 1302020, 1, 1, 0, 1000, '楓葉之劍'),
(14, -1, 0, 1302030, 1, 1, 0, 1000, '楓葉戰劍'),
(15, -1, 0, 1332025, 1, 1, 0, 1000, '楓葉短刀'),
(16, -1, 0, 1382009, 1, 1, 0, 1000, '楓葉之杖'),
(17, -1, 0, 1382012, 1, 1, 0, 1000, '楓葉法杖'),
(18, -1, 0, 1412011, 1, 1, 0, 1000, '楓葉戰斧'),
(19, -1, 0, 1422014, 1, 1, 0, 1000, '楓葉戰鎚'),
(20, -1, 0, 1432012, 1, 1, 0, 1000, '楓葉之槍'),
(21, -1, 0, 1442024, 1, 1, 0, 1000, '楓葉之矛'),
(22, -1, 0, 1452022, 1, 1, 0, 1000, '楓葉之弓'),
(23, -1, 0, 1462019, 1, 1, 0, 1000, '楓葉火槍'),
(24, -1, 0, 1462019, 1, 1, 0, 1000, '楓葉之弩'),
(25, -1, 0, 1472030, 1, 1, 0, 1000, '楓葉指套'),
(26, -1, 0, 1472032, 1, 1, 0, 1000, '楓葉拳套'),
(27, -1, 0, 1482020, 1, 1, 0, 1000, '楓葉指虎'),
(28, -1, 0, 1002508, 1, 1, 0, 3000, '真‧楓葉頭盔 - 0 等'),
(29, -1, 0, 1002509, 1, 1, 0, 1500, '真‧楓葉頭盔 - 8 等'),
(30, -1, 0, 1002510, 1, 1, 0, 600, '真‧楓葉頭盔 - 30 等'),
(31, -1, 0, 1002511, 1, 1, 0, 300, '真‧楓葉頭盔 - 70 等'),
(32, -1, 0, 1032035, 1, 1, 0, 300, '真‧楓葉耳環'),
(33, -1, 0, 1032040, 1, 1, 0, 3000, '楓葉赤光耳環'),
(34, -1, 0, 1032041, 1, 1, 0, 1500, '楓葉赤光耳環'),
(35, -1, 0, 1032042, 1, 1, 0, 300, '楓葉赤光耳環'),
(36, -1, 0, 1102071, 1, 1, 0, 300, '真‧楓葉披風'),
(37, -1, 0, 1302058, 1, 1, 0, 300, '真‧楓葉巨傘'),
(38, -1, 0, 1302064, 1, 1, 0, 300, '楓葉絕世之劍'),
(39, -1, 0, 1312032, 1, 1, 0, 300, '楓葉霸道之斧'),
(40, -1, 0, 1322054, 1, 1, 0, 300, '楓葉粉碎之鎚'),
(41, -1, 0, 1332048, 1, 1, 0, 300, '真‧楓葉鐵扇'),
(42, -1, 0, 1332055, 1, 1, 0, 300, '楓葉黑夜匕首'),
(43, -1, 0, 1332056, 1, 1, 0, 300, '楓葉修羅短刃'),
(44, -1, 0, 1372034, 1, 1, 0, 300, '楓葉靈魂短杖'),
(45, -1, 0, 1382039, 1, 1, 0, 300, '楓葉智慧長杖'),
(46, -1, 0, 1402039, 1, 1, 0, 300, '楓葉王者之劍'),
(47, -1, 0, 1412027, 1, 1, 0, 300, '楓葉惡魔之斧'),
(48, -1, 0, 1422029, 1, 1, 0, 300, '楓葉爆裂之鎚'),
(49, -1, 0, 1432037, 1, 1, 0, 300, '真‧楓葉旗幟'),
(50, -1, 0, 1432040, 1, 1, 0, 300, '楓葉銀月之槍'),
(51, -1, 0, 1442051, 1, 1, 0, 300, '楓葉狂風之矛'),
(52, -1, 0, 1452043, 1, 1, 0, 300, '真‧楓葉之弓'),
(53, -1, 0, 1452045, 1, 1, 0, 300, '楓葉射日之弓'),
(54, -1, 0, 1462038, 1, 1, 0, 300, '真‧楓葉之弩'),
(55, -1, 0, 1462040, 1, 1, 0, 300, '楓葉追星之弩'),
(56, -1, 0, 1472050, 1, 1, 0, 300, '真‧楓葉拳套'),
(57, -1, 0, 1472055, 1, 1, 0, 300, '楓葉神獸拳套'),
(58, -1, 0, 1482021, 1, 1, 0, 1500, '楓葉暴風指虎'),
(59, -1, 0, 1482022, 1, 1, 0, 300, '楓葉黃金指虎'),
(60, -1, 0, 1492021, 1, 1, 0, 1500, '楓葉暴風火槍'),
(61, -1, 0, 1492022, 1, 1, 0, 300, '楓葉炫風火槍'),
(62, -1, 0, 1122019, 1, 1, 0, 6000, '楓葉之心'),
(63, -1, 0, 1122024, 1, 1, 0, 50, '封印的楓葉之心 - 劍士'),
(64, -1, 0, 1122025, 1, 1, 0, 50, '封印的楓葉之心 - 法師'),
(65, -1, 0, 1122026, 1, 1, 0, 50, '封印的楓葉之心 - 弓箭手'),
(66, -1, 0, 1122027, 1, 1, 0, 50, '封印的楓葉之心 - 盜賊'),
(67, -1, 0, 1122028, 1, 1, 0, 50, '封印的楓葉之心 - 海盜'),
(68, -1, 0, 1122029, 1, 1, 0, 25, '甦醒的楓葉之心 - 劍士'),
(69, -1, 0, 1122030, 1, 1, 0, 25, '甦醒的楓葉之心 - 法師'),
(70, -1, 0, 1122031, 1, 1, 0, 25, '甦醒的楓葉之心 - 弓箭手'),
(71, -1, 0, 1122032, 1, 1, 0, 25, '甦醒的楓葉之心 - 盜賊'),
(72, -1, 0, 1122033, 1, 1, 0, 25, '甦醒的楓葉之心 - 海盜'),
(73, -1, 0, 1122034, 1, 1, 0, 5, '覺醒的楓葉之心 - 劍士'),
(74, -1, 0, 1122035, 1, 1, 0, 5, '覺醒的楓葉之心 - 法師'),
(75, -1, 0, 1122036, 1, 1, 0, 5, '覺醒的楓葉之心 - 弓箭手'),
(76, -1, 0, 1122037, 1, 1, 0, 5, '覺醒的楓葉之心 - 盜賊'),
(77, -1, 0, 1122038, 1, 1, 0, 5, '覺醒的楓葉之心 - 海盜');


ALTER TABLE `drop_data_global`
  ADD PRIMARY KEY (`id`),
  ADD KEY `chance` (`chance`);


ALTER TABLE `drop_data_global`
  MODIFY `id` bigint(20) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=78;
SET FOREIGN_KEY_CHECKS=1;
COMMIT;

/*!40101 SET CHARACTER_SET_CLIENT=@OLD_CHARACTER_SET_CLIENT */;
/*!40101 SET CHARACTER_SET_RESULTS=@OLD_CHARACTER_SET_RESULTS */;
/*!40101 SET COLLATION_CONNECTION=@OLD_COLLATION_CONNECTION */;
